apache/nuttx/arch/arm/src/kinetis/chip/kinetis_k28pinmux.h
/********************************************************************************************
 * arch/arm/src/kinetis/chip/kinetis_k28pinmux.h
 *
 *   Copyright (C) 2018 Gregory Nutt. All rights reserved.
 *   Authors: Gregory Nutt <gnutt@nuttx.org>
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ********************************************************************************************/

#ifndef __ARCH_ARM_SRC_KINETIS_CHP_KINETIS_K28PINMUX_H
#define __ARCH_ARM_SRC_KINETIS_CHP_KINETIS_K28PINMUX_H

/********************************************************************************************
 * Included Files
 ********************************************************************************************/

#include <nuttx/config.h>

#include "chip.h"

#ifdef KINETIS_K28

/********************************************************************************************
 * Pre-processor Definitions
 ********************************************************************************************/

/* In most cases, there are alternative configurations for various pins. Those alternative
 * pins are labeled with a suffix like _1, _2, etc. in order to distinguish them.  Logic in
 * the board.h file must select the correct pin configuration for the board by defining a pin
 * configuration (with no suffix) that maps to the correct alternative.
 *
 * WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!! WARNING!!!
 * Additional effort is required to select specific GPIO options such as frequency,
 * open-drain/push-pull, and pull-up/down!  Just the basics are defined for most
 * pins in the initial version of this file.
 */

/* ADC */

#define PIN_ADC0_SE10                   (PIN_ANALOG | PIN_PORTA | PIN7)
#define PIN_ADC0_SE11                   (PIN_ANALOG | PIN_PORTA | PIN8)
#define PIN_ADC0_SE12                   (PIN_ANALOG | PIN_PORTB | PIN2)
#define PIN_ADC0_SE13                   (PIN_ANALOG | PIN_PORTB | PIN3)
#define PIN_ADC0_SE14                   (PIN_ANALOG | PIN_PORTC | PIN0)
#define PIN_ADC0_SE15                   (PIN_ANALOG | PIN_PORTC | PIN1)
#define PIN_ADC0_SE4A                   (PIN_ANALOG | PIN_PORTE | PIN16)
#define PIN_ADC0_SE4B                   (PIN_ANALOG | PIN_PORTC | PIN2)
#define PIN_ADC0_SE5A                   (PIN_ANALOG | PIN_PORTE | PIN17)
#define PIN_ADC0_SE5B                   (PIN_ANALOG | PIN_PORTD | PIN1)
#define PIN_ADC0_SE6A                   (PIN_ANALOG | PIN_PORTE | PIN18)
#define PIN_ADC0_SE6B                   (PIN_ANALOG | PIN_PORTD | PIN5)
#define PIN_ADC0_SE7A                   (PIN_ANALOG | PIN_PORTE | PIN19)
#define PIN_ADC0_SE7B                   (PIN_ANALOG | PIN_PORTD | PIN6)
#define PIN_ADC0_SE8                    (PIN_ANALOG | PIN_PORTB | PIN0)
#define PIN_ADC0_SE9                    (PIN_ANALOG | PIN_PORTB | PIN1)

/* Output clock */

#define PIN_CLKOUT                      (PIN_ALT5 | PIN_PORTA | PIN6)
#define PIN_CLKOUT                      (PIN_ALT5 | PIN_PORTC | PIN3)

/* Comparators */

#define PIN_CMP0_IN0                    (PIN_ALT0 | PIN_PORTC | PIN6)
#define PIN_CMP0_IN1                    (PIN_ALT0 | PIN_PORTC | PIN7)
#define PIN_CMP0_IN2                    (PIN_ALT0 | PIN_PORTC | PIN8)
#define PIN_CMP0_IN3                    (PIN_ALT0 | PIN_PORTC | PIN9)
#define PIN_CMP0_OUT_1                  (PIN_ALT6 | PIN_PORTB | PIN20)
#define PIN_CMP0_OUT_2                  (PIN_ALT6 | PIN_PORTC | PIN5)

#define PIN_CMP1_IN0                    (PIN_ALT0 | PIN_PORTC | PIN2)
#define PIN_CMP1_IN1                    (PIN_ALT0 | PIN_PORTC | PIN3)
#define PIN_CMP1_OUT_1                  (PIN_ALT6 | PIN_PORTB | PIN21)
#define PIN_CMP1_OUT_2                  (PIN_ALT6 | PIN_PORTC | PIN4)

/* Carrier Modulator Transmittor (CMT) */

#define PIN_CMT_IRO                     (PIN_ALT2 | PIN_PORTD | PIN7)

/* External Watchdog Monitor (EWM) */

#define PIN_EWM_IN_1                    (PIN_ALT6 | PIN_PORTA | PIN21)
#define PIN_EWM_IN_2                    (PIN_ALT6 | PIN_PORTB | PIN16)
#define PIN_EWM_IN_3                    (PIN_ALT6 | PIN_PORTD | PIN4)
#define PIN_EWM_OUT_1                   (PIN_ALT6 | PIN_PORTA | PIN20)
#define PIN_EWM_OUT_2                   (PIN_ALT6 | PIN_PORTB | PIN17)
#define PIN_EWM_OUT_3                   (PIN_ALT6 | PIN_PORTD | PIN5)

/* External Crystal */

#define PIN_EXTAL0                      (PIN_ALT0 | PIN_PORTA | PIN18)
#define PIN_XTAL0                       (PIN_ALT0 | PIN_PORTA | PIN19)

/* FlexBus */

#define PIN_FB_A0                       (PIN_ALT5 | PIN_PORTC | PIN29)
#define PIN_FB_A2                       (PIN_ALT5 | PIN_PORTC | PIN27)
#define PIN_FB_A3                       (PIN_ALT5 | PIN_PORTC | PIN26)
#define PIN_FB_A4                       (PIN_ALT5 | PIN_PORTC | PIN25)
#define PIN_FB_A5                       (PIN_ALT5 | PIN_PORTC | PIN24)
#define PIN_FB_A6                       (PIN_ALT5 | PIN_PORTB | PIN15)
#define PIN_FB_A7                       (PIN_ALT5 | PIN_PORTB | PIN14)
#define PIN_FB_A8                       (PIN_ALT5 | PIN_PORTB | PIN13)
#define PIN_FB_A9                       (PIN_ALT5 | PIN_PORTB | PIN12)
#define PIN_FB_A1                       (PIN_ALT5 | PIN_PORTC | PIN28)
#define PIN_FB_A10                      (PIN_ALT5 | PIN_PORTA | PIN31)
#define PIN_FB_A11                      (PIN_ALT5 | PIN_PORTA | PIN30)
#define PIN_FB_A12                      (PIN_ALT5 | PIN_PORTA | PIN27)
#define PIN_FB_A13                      (PIN_ALT5 | PIN_PORTA | PIN26)
#define PIN_FB_A14                      (PIN_ALT5 | PIN_PORTA | PIN25)
#define PIN_FB_A15                      (PIN_ALT5 | PIN_PORTA | PIN24)
#define PIN_FB_A16                      (PIN_ALT6 | PIN_PORTD | PIN8)
#define PIN_FB_A17                      (PIN_ALT6 | PIN_PORTD | PIN9)
#define PIN_FB_A18                      (PIN_ALT6 | PIN_PORTD | PIN10)
#define PIN_FB_A19                      (PIN_ALT6 | PIN_PORTD | PIN11)
#define PIN_FB_A20                      (PIN_ALT6 | PIN_PORTD | PIN12)
#define PIN_FB_A21                      (PIN_ALT6 | PIN_PORTD | PIN13)
#define PIN_FB_A22                      (PIN_ALT6 | PIN_PORTD | PIN14)
#define PIN_FB_A23                      (PIN_ALT6 | PIN_PORTD | PIN15)
#define PIN_FB_A24                      (PIN_ALT6 | PIN_PORTA | PIN29)
#define PIN_FB_A25                      (PIN_ALT6 | PIN_PORTA | PIN28)
#define PIN_FB_A26                      (PIN_ALT6 | PIN_PORTA | PIN27)
#define PIN_FB_A27                      (PIN_ALT6 | PIN_PORTA | PIN26)
#define PIN_FB_A28                      (PIN_ALT6 | PIN_PORTA | PIN25)
#define PIN_FB_A29                      (PIN_ALT6 | PIN_PORTA | PIN24)
#define PIN_FB_AD0                      (PIN_ALT5 | PIN_PORTD | PIN6)
#define PIN_FB_AD1                      (PIN_ALT5 | PIN_PORTD | PIN5)
#define PIN_FB_AD2                      (PIN_ALT5 | PIN_PORTD | PIN4)
#define PIN_FB_AD4                      (PIN_ALT5 | PIN_PORTD | PIN2)
#define PIN_FB_AD5                      (PIN_ALT5 | PIN_PORTC | PIN10)
#define PIN_FB_AD6                      (PIN_ALT5 | PIN_PORTC | PIN9)
#define PIN_FB_AD7                      (PIN_ALT5 | PIN_PORTC | PIN8)
#define PIN_FB_AD8                      (PIN_ALT5 | PIN_PORTC | PIN7)
#define PIN_FB_AD9                      (PIN_ALT5 | PIN_PORTC | PIN6)
#define PIN_FB_AD10                     (PIN_ALT5 | PIN_PORTC | PIN5)
#define PIN_FB_AD11                     (PIN_ALT5 | PIN_PORTC | PIN4)
#define PIN_FB_AD12                     (PIN_ALT5 | PIN_PORTC | PIN2)
#define PIN_FB_AD13                     (PIN_ALT5 | PIN_PORTC | PIN1)
#define PIN_FB_AD14                     (PIN_ALT5 | PIN_PORTC | PIN0)
#define PIN_FB_AD15                     (PIN_ALT5 | PIN_PORTB | PIN18)
#define PIN_FB_AD16                     (PIN_ALT5 | PIN_PORTB | PIN17)
#define PIN_FB_AD17                     (PIN_ALT5 | PIN_PORTB | PIN16)
#define PIN_FB_AD18                     (PIN_ALT5 | PIN_PORTB | PIN11)
#define PIN_FB_AD19                     (PIN_ALT5 | PIN_PORTB | PIN10)
#define PIN_FB_AD20                     (PIN_ALT5 | PIN_PORTB | PIN9)
#define PIN_FB_AD21                     (PIN_ALT5 | PIN_PORTB | PIN8)
#define PIN_FB_AD22                     (PIN_ALT5 | PIN_PORTB | PIN7)
#define PIN_FB_AD23                     (PIN_ALT5 | PIN_PORTB | PIN6)
#define PIN_FB_AD24                     (PIN_ALT5 | PIN_PORTC | PIN15)
#define PIN_FB_AD25                     (PIN_ALT5 | PIN_PORTC | PIN14)
#define PIN_FB_AD26                     (PIN_ALT5 | PIN_PORTC | PIN13)
#define PIN_FB_AD27                     (PIN_ALT5 | PIN_PORTC | PIN12)
#define PIN_FB_AD28                     (PIN_ALT5 | PIN_PORTB | PIN23)
#define PIN_FB_AD29                     (PIN_ALT5 | PIN_PORTB | PIN22)
#define PIN_FB_AD3                      (PIN_ALT5 | PIN_PORTD | PIN3)
#define PIN_FB_AD30                     (PIN_ALT5 | PIN_PORTB | PIN21)
#define PIN_FB_AD31                     (PIN_ALT5 | PIN_PORTB | PIN20)
#define PIN_FB_ALE                      (PIN_ALT5 | PIN_PORTD | PIN0)
#define PIN_FB_BE7_0_BLS31_24           (PIN_ALT5 | PIN_PORTC | PIN19)
#define PIN_FB_BE15_8_BLS23_16          (PIN_ALT5 | PIN_PORTC | PIN18)
#define PIN_FB_BE23_16_BLS15_8          (PIN_ALT5 | PIN_PORTC | PIN16)
#define PIN_FB_BE31_24_BLS7_0           (PIN_ALT5 | PIN_PORTC | PIN17)
#define PIN_FB_CS0                      (PIN_ALT5 | PIN_PORTD | PIN1)
#define PIN_FB_CS1                      (PIN_ALT5 | PIN_PORTD | PIN0)
#define PIN_FB_CS2                      (PIN_ALT5 | PIN_PORTC | PIN18)
#define PIN_FB_CS3                      (PIN_ALT5 | PIN_PORTC | PIN19)
#define PIN_FB_CS4                      (PIN_ALT5 | PIN_PORTC | PIN17)
#define PIN_FB_CS5                      (PIN_ALT5 | PIN_PORTC | PIN16)
#define PIN_FB_OE                       (PIN_ALT5 | PIN_PORTB | PIN19)
#define PIN_FB_RW                       (PIN_ALT5 | PIN_PORTC | PIN11)
#define PIN_FB_TA                       (PIN_ALT6 | PIN_PORTC | PIN19)
#define PIN_FB_TBST                     (PIN_ALT5 | PIN_PORTC | PIN18)
#define PIN_FB_TS                       (PIN_ALT5 | PIN_PORTD | PIN0)
#define PIN_FB_TSIZ0                    (PIN_ALT5 | PIN_PORTC | PIN17)
#define PIN_FB_TSIZ1                    (PIN_ALT5 | PIN_PORTC | PIN16)

/* FlexTimer Module (FTM) */

#define PIN_FTM_CLKIN0_1                (PIN_ALT4 | PIN_PORTA | PIN18)
#define PIN_FTM_CLKIN0_2                (PIN_ALT4 | PIN_PORTB | PIN16)
#define PIN_FTM_CLKIN0_3                (PIN_ALT4 | PIN_PORTC | PIN12)
#define PIN_FTM_CLKIN0_4                (PIN_ALT4 | PIN_PORTE | PIN16)
#define PIN_FTM_CLKIN1_2                (PIN_ALT4 | PIN_PORTA | PIN19)
#define PIN_FTM_CLKIN1_3                (PIN_ALT4 | PIN_PORTA | PIN20)
#define PIN_FTM_CLKIN1_4                (PIN_ALT4 | PIN_PORTB | PIN17)
#define PIN_FTM_CLKIN1_5                (PIN_ALT4 | PIN_PORTC | PIN13)
#define PIN_FTM_CLKIN1_6                (PIN_ALT4 | PIN_PORTE | PIN17)

#define PIN_FTM0_CH0_1                  (PIN_ALT3 | PIN_PORTA | PIN3)
#define PIN_FTM0_CH0_2                  (PIN_ALT4 | PIN_PORTC | PIN1)
#define PIN_FTM0_CH1_1                  (PIN_ALT3 | PIN_PORTA | PIN4)
#define PIN_FTM0_CH1_2                  (PIN_ALT4 | PIN_PORTC | PIN2)
#define PIN_FTM0_CH2_1                  (PIN_ALT3 | PIN_PORTA | PIN5)
#define PIN_FTM0_CH2_2                  (PIN_ALT4 | PIN_PORTC | PIN3)
#define PIN_FTM0_CH2_3                  (PIN_ALT7 | PIN_PORTC | PIN5)
#define PIN_FTM0_CH3_1                  (PIN_ALT3 | PIN_PORTA | PIN6)
#define PIN_FTM0_CH3_2                  (PIN_ALT4 | PIN_PORTC | PIN4)
#define PIN_FTM0_CH4_1                  (PIN_ALT3 | PIN_PORTA | PIN7)
#define PIN_FTM0_CH4_2                  (PIN_ALT4 | PIN_PORTB | PIN12)
#define PIN_FTM0_CH4_3                  (PIN_ALT4 | PIN_PORTD | PIN4)
#define PIN_FTM0_CH5_1                  (PIN_ALT3 | PIN_PORTA | PIN0)
#define PIN_FTM0_CH5_2                  (PIN_ALT4 | PIN_PORTB | PIN13)
#define PIN_FTM0_CH5_3                  (PIN_ALT4 | PIN_PORTD | PIN5)
#define PIN_FTM0_CH6_1                  (PIN_ALT3 | PIN_PORTA | PIN1)
#define PIN_FTM0_CH6_2                  (PIN_ALT4 | PIN_PORTD | PIN6)
#define PIN_FTM0_CH7_1                  (PIN_ALT3 | PIN_PORTA | PIN2)
#define PIN_FTM0_CH7_2                  (PIN_ALT4 | PIN_PORTD | PIN7)
#define PIN_FTM0_FLT0_1                 (PIN_ALT6 | PIN_PORTB | PIN3)
#define PIN_FTM0_FLT0_2                 (PIN_ALT6 | PIN_PORTD | PIN6)
#define PIN_FTM0_FLT1_1                 (PIN_ALT6 | PIN_PORTB | PIN10)
#define PIN_FTM0_FLT1_2                 (PIN_ALT6 | PIN_PORTD | PIN7)
#define PIN_FTM0_FLT2_1                 (PIN_ALT3 | PIN_PORTA | PIN18)
#define PIN_FTM0_FLT2_2                 (PIN_ALT6 | PIN_PORTB | PIN11)
#define PIN_FTM0_FLT3_1                 (PIN_ALT6 | PIN_PORTB | PIN2)
#define PIN_FTM0_FLT3_2                 (PIN_ALT6 | PIN_PORTE | PIN16)

