apache/nuttx/arch/arm/src/kinetis/chip/kinetis_k28pinmux.h
#define PIN_FTM1_CH0_1                  (PIN_ALT3 | PIN_PORTA | PIN12)
#define PIN_FTM1_CH0_2                  (PIN_ALT3 | PIN_PORTA | PIN8)
#define PIN_FTM1_CH0_1                  (PIN_ALT3 | PIN_PORTB | PIN0)
#define PIN_FTM1_CH0_2                  (PIN_ALT3 | PIN_PORTB | PIN12)
#define PIN_FTM1_CH1_1                  (PIN_ALT3 | PIN_PORTA | PIN13)
#define PIN_FTM1_CH1_2                  (PIN_ALT3 | PIN_PORTA | PIN9)
#define PIN_FTM1_CH1_3                  (PIN_ALT3 | PIN_PORTB | PIN1)
#define PIN_FTM1_CH1_4                  (PIN_ALT3 | PIN_PORTB | PIN13)
#define PIN_FTM1_FLT0_1                 (PIN_ALT3 | PIN_PORTA | PIN19)
#define PIN_FTM1_FLT0_2                 (PIN_ALT6 | PIN_PORTB | PIN4)
#define PIN_FTM1_QD_PHA_1               (PIN_ALT6 | PIN_PORTA | PIN8)
#define PIN_FTM1_QD_PHA_2               (PIN_ALT6 | PIN_PORTB | PIN0)
#define PIN_FTM1_QD_PHA_3               (PIN_ALT6 | PIN_PORTB | PIN12)
#define PIN_FTM1_QD_PHA_4               (PIN_ALT7 | PIN_PORTA | PIN12)
#define PIN_FTM1_QD_PHB_1               (PIN_ALT6 | PIN_PORTA | PIN9)
#define PIN_FTM1_QD_PHB_2               (PIN_ALT6 | PIN_PORTB | PIN1)
#define PIN_FTM1_QD_PHB_3               (PIN_ALT6 | PIN_PORTB | PIN13)
#define PIN_FTM1_QD_PHB_4               (PIN_ALT7 | PIN_PORTA | PIN13)

#define PIN_FTM2_CH0_1                  (PIN_ALT3 | PIN_PORTA | PIN10)
#define PIN_FTM2_CH0_2                  (PIN_ALT3 | PIN_PORTB | PIN18)
#define PIN_FTM2_CH1_1                  (PIN_ALT3 | PIN_PORTA | PIN11)
#define PIN_FTM2_CH1_2                  (PIN_ALT3 | PIN_PORTB | PIN19)
#define PIN_FTM2_FLT0_1                 (PIN_ALT6 | PIN_PORTB | PIN5)
#define PIN_FTM2_FLT0_2                 (PIN_ALT6 | PIN_PORTC | PIN9)
#define PIN_FTM2_QD_PHA_1               (PIN_ALT6 | PIN_PORTA | PIN10)
#define PIN_FTM2_QD_PHA_2               (PIN_ALT6 | PIN_PORTB | PIN18)
#define PIN_FTM2_QD_PHB_1               (PIN_ALT6 | PIN_PORTA | PIN11)
#define PIN_FTM2_QD_PHB_2               (PIN_ALT6 | PIN_PORTB | PIN19)

#define PIN_FTM3_CH0_1                  (PIN_ALT4 | PIN_PORTD | PIN0)
#define PIN_FTM3_CH0_2                  (PIN_ALT6 | PIN_PORTE | PIN5)
#define PIN_FTM3_CH1_1                  (PIN_ALT4 | PIN_PORTD | PIN1)
#define PIN_FTM3_CH1_2                  (PIN_ALT6 | PIN_PORTE | PIN6)
#define PIN_FTM3_CH2_1                  (PIN_ALT4 | PIN_PORTD | PIN2)
#define PIN_FTM3_CH2_2                  (PIN_ALT6 | PIN_PORTE | PIN7)
#define PIN_FTM3_CH3_1                  (PIN_ALT4 | PIN_PORTD | PIN3)
#define PIN_FTM3_CH3_2                  (PIN_ALT6 | PIN_PORTE | PIN8)
#define PIN_FTM3_CH4_1                  (PIN_ALT3 | PIN_PORTC | PIN8)
#define PIN_FTM3_CH4_2                  (PIN_ALT6 | PIN_PORTE | PIN9)
#define PIN_FTM3_CH5_1                  (PIN_ALT3 | PIN_PORTC | PIN9)
#define PIN_FTM3_CH5_2                  (PIN_ALT6 | PIN_PORTE | PIN10)
#define PIN_FTM3_CH6_1                  (PIN_ALT3 | PIN_PORTC | PIN10)
#define PIN_FTM3_CH6_2                  (PIN_ALT6 | PIN_PORTE | PIN11)
#define PIN_FTM3_CH7_1                  (PIN_ALT3 | PIN_PORTC | PIN11)
#define PIN_FTM3_CH7_2                  (PIN_ALT6 | PIN_PORTE | PIN12)
#define PIN_FTM3_FLT0_1                 (PIN_ALT3 | PIN_PORTD | PIN12)
#define PIN_FTM3_FLT0_2                 (PIN_ALT6 | PIN_PORTC | PIN12)

/* FlexIO */

#define PIN_FXIO0_D0_1                  (PIN_ALT6 | PIN_PORTE | PIN2)
#define PIN_FXIO0_D0_2                  (PIN_ALT7 | PIN_PORTB | PIN0)
#define PIN_FXIO0_D1_1                  (PIN_ALT6 | PIN_PORTE | PIN3)
#define PIN_FXIO0_D1_2                  (PIN_ALT7 | PIN_PORTB | PIN1)
#define PIN_FXIO0_D2_1                  (PIN_ALT7 | PIN_PORTB | PIN2)
#define PIN_FXIO0_D2_2                  (PIN_ALT7 | PIN_PORTE | PIN12)
#define PIN_FXIO0_D3_1                  (PIN_ALT7 | PIN_PORTB | PIN3)
#define PIN_FXIO0_D3_2                  (PIN_ALT7 | PIN_PORTE | PIN13)
#define PIN_FXIO0_D4_1                  (PIN_ALT7 | PIN_PORTB | PIN10)
#define PIN_FXIO0_D4_2                  (PIN_ALT7 | PIN_PORTE | PIN16)
#define PIN_FXIO0_D5_1                  (PIN_ALT7 | PIN_PORTB | PIN11)
#define PIN_FXIO0_D5_2                  (PIN_ALT7 | PIN_PORTE | PIN17)
#define PIN_FXIO0_D6_1                  (PIN_ALT5 | PIN_PORTA | PIN22)
#define PIN_FXIO0_D6_2                  (PIN_ALT7 | PIN_PORTB | PIN18)
#define PIN_FXIO0_D6_3                  (PIN_ALT7 | PIN_PORTE | PIN18)
#define PIN_FXIO0_D7_1                  (PIN_ALT5 | PIN_PORTA | PIN23)
#define PIN_FXIO0_D7_2                  (PIN_ALT7 | PIN_PORTB | PIN19)
#define PIN_FXIO0_D7_3                  (PIN_ALT7 | PIN_PORTE | PIN19)
#define PIN_FXIO0_D8_1                  (PIN_ALT5 | PIN_PORTA | PIN20)
#define PIN_FXIO0_D8_2                  (PIN_ALT7 | PIN_PORTB | PIN20)
#define PIN_FXIO0_D8_3                  (PIN_ALT7 | PIN_PORTE | PIN20)
#define PIN_FXIO0_D9_1                  (PIN_ALT5 | PIN_PORTA | PIN21)
#define PIN_FXIO0_D9_2                  (PIN_ALT7 | PIN_PORTB | PIN21)
#define PIN_FXIO0_D9_3                  (PIN_ALT7 | PIN_PORTE | PIN21)
#define PIN_FXIO0_D10_1                 (PIN_ALT5 | PIN_PORTA | PIN0)
#define PIN_FXIO0_D10_2                 (PIN_ALT7 | PIN_PORTB | PIN22)
#define PIN_FXIO0_D10_3                 (PIN_ALT7 | PIN_PORTE | PIN22)
#define PIN_FXIO0_D11_1                 (PIN_ALT5 | PIN_PORTA | PIN1)
#define PIN_FXIO0_D11_2                 (PIN_ALT7 | PIN_PORTB | PIN23)
#define PIN_FXIO0_D11_3                 (PIN_ALT7 | PIN_PORTE | PIN23)
#define PIN_FXIO0_D12_1                 (PIN_ALT2 | PIN_PORTE | PIN6)
#define PIN_FXIO0_D12_2                 (PIN_ALT5 | PIN_PORTA | PIN2)
#define PIN_FXIO0_D12_3                 (PIN_ALT7 | PIN_PORTC | PIN0)
#define PIN_FXIO0_D13_1                 (PIN_ALT2 | PIN_PORTE | PIN7)
#define PIN_FXIO0_D13_2                 (PIN_ALT5 | PIN_PORTA | PIN3)
#define PIN_FXIO0_D13_3                 (PIN_ALT7 | PIN_PORTC | PIN1)
#define PIN_FXIO0_D14_1                 (PIN_ALT3 | PIN_PORTE | PIN8)
#define PIN_FXIO0_D14_2                 (PIN_ALT5 | PIN_PORTA | PIN4)
#define PIN_FXIO0_D14_3                 (PIN_ALT7 | PIN_PORTC | PIN6)
#define PIN_FXIO0_D15_1                 (PIN_ALT3 | PIN_PORTE | PIN9)
#define PIN_FXIO0_D15_2                 (PIN_ALT5 | PIN_PORTA | PIN5)
#define PIN_FXIO0_D15_3                 (PIN_ALT7 | PIN_PORTC | PIN7)
#define PIN_FXIO0_D16_1                 (PIN_ALT3 | PIN_PORTE | PIN10)
#define PIN_FXIO0_D16_2                 (PIN_ALT5 | PIN_PORTA | PIN10)
#define PIN_FXIO0_D16_3                 (PIN_ALT7 | PIN_PORTC | PIN8)
#define PIN_FXIO0_D17_1                 (PIN_ALT3 | PIN_PORTE | PIN11)
#define PIN_FXIO0_D17_2                 (PIN_ALT5 | PIN_PORTA | PIN11)
#define PIN_FXIO0_D17_3                 (PIN_ALT7 | PIN_PORTC | PIN9)
#define PIN_FXIO0_D18_1                 (PIN_ALT5 | PIN_PORTA | PIN12)
#define PIN_FXIO0_D18_2                 (PIN_ALT7 | PIN_PORTC | PIN10)
#define PIN_FXIO0_D19_1                 (PIN_ALT5 | PIN_PORTA | PIN13)
#define PIN_FXIO0_D19_2                 (PIN_ALT7 | PIN_PORTC | PIN11)
#define PIN_FXIO0_D20_1                 (PIN_ALT5 | PIN_PORTA | PIN14)
#define PIN_FXIO0_D20_2                 (PIN_ALT7 | PIN_PORTC | PIN14)
#define PIN_FXIO0_D21_1                 (PIN_ALT5 | PIN_PORTA | PIN15)
#define PIN_FXIO0_D21_2                 (PIN_ALT7 | PIN_PORTC | PIN15)
#define PIN_FXIO0_D22_1                 (PIN_ALT5 | PIN_PORTA | PIN16)
#define PIN_FXIO0_D22_2                 (PIN_ALT7 | PIN_PORTD | PIN0)
#define PIN_FXIO0_D23_1                 (PIN_ALT5 | PIN_PORTA | PIN17)
#define PIN_FXIO0_D23_2                 (PIN_ALT7 | PIN_PORTD | PIN1)
#define PIN_FXIO0_D24                   (PIN_ALT7 | PIN_PORTD | PIN8)
#define PIN_FXIO0_D25                   (PIN_ALT7 | PIN_PORTD | PIN9)
#define PIN_FXIO0_D26                   (PIN_ALT7 | PIN_PORTD | PIN10)
#define PIN_FXIO0_D27                   (PIN_ALT7 | PIN_PORTD | PIN11)
#define PIN_FXIO0_D28                   (PIN_ALT7 | PIN_PORTD | PIN12)
#define PIN_FXIO0_D29                   (PIN_ALT7 | PIN_PORTD | PIN13)
#define PIN_FXIO0_D30                   (PIN_ALT7 | PIN_PORTD | PIN14)
#define PIN_FXIO0_D31                   (PIN_ALT7 | PIN_PORTD | PIN15)

/* I2C */

#define PIN_I2C0_SCL_1                  (PIN_ALT2_OPENDRAIN | PIN_PORTA | PIN20)
#define PIN_I2C0_SCL_2                  (PIN_ALT2_OPENDRAIN | PIN_PORTB | PIN0)
#define PIN_I2C0_SCL_3                  (PIN_ALT2_OPENDRAIN | PIN_PORTB | PIN2)
#define PIN_I2C0_SCL_4                  (PIN_ALT2_OPENDRAIN | PIN_PORTD | PIN8)
#define PIN_I2C0_SCL_5                  (PIN_ALT4_OPENDRAIN | PIN_PORTE | PIN19)
#define PIN_I2C0_SCL_6                  (PIN_ALT7_OPENDRAIN | PIN_PORTD | PIN2)
#define PIN_I2C0_SDA_1                  (PIN_ALT2_OPENDRAIN | PIN_PORTA | PIN21)
#define PIN_I2C0_SDA_2                  (PIN_ALT2_OPENDRAIN | PIN_PORTB | PIN1)
#define PIN_I2C0_SDA_3                  (PIN_ALT2_OPENDRAIN | PIN_PORTB | PIN3)
#define PIN_I2C0_SDA_4                  (PIN_ALT2_OPENDRAIN | PIN_PORTD | PIN9)
#define PIN_I2C0_SDA_5                  (PIN_ALT4_OPENDRAIN | PIN_PORTE | PIN18)
#define PIN_I2C0_SDA_6                  (PIN_ALT7_OPENDRAIN | PIN_PORTD | PIN3)

#define PIN_I2C1_SCL_1                  (PIN_ALT2_OPENDRAIN | PIN_PORTA | PIN8)
#define PIN_I2C1_SCL_2                  (PIN_ALT2_OPENDRAIN | PIN_PORTC | PIN10)
#define PIN_I2C1_SCL_3                  (PIN_ALT6_OPENDRAIN | PIN_PORTE | PIN1)
#define PIN_I2C1_SDA_1                  (PIN_ALT2_OPENDRAIN | PIN_PORTA | PIN9)
#define PIN_I2C1_SDA_2                  (PIN_ALT2_OPENDRAIN | PIN_PORTC | PIN11)
#define PIN_I2C1_SDA_3                  (PIN_ALT6_OPENDRAIN | PIN_PORTE | PIN0)
#define PIN_I2C2_SCL_1                  (PIN_ALT2_OPENDRAIN | PIN_PORTA | PIN11)
#define PIN_I2C2_SCL_2                  (PIN_ALT2_OPENDRAIN | PIN_PORTA | PIN6)
#define PIN_I2C2_SCL_3                  (PIN_ALT2_OPENDRAIN | PIN_PORTE | PIN23)
#define PIN_I2C2_SCL_4                  (PIN_ALT4_OPENDRAIN | PIN_PORTB | PIN10)
#define PIN_I2C2_SDA_1                  (PIN_ALT2_OPENDRAIN | PIN_PORTA | PIN10)
#define PIN_I2C2_SDA_2                  (PIN_ALT2_OPENDRAIN | PIN_PORTA | PIN7)
#define PIN_I2C2_SDA_3                  (PIN_ALT2_OPENDRAIN | PIN_PORTE | PIN22)
#define PIN_I2C2_SDA_4                  (PIN_ALT4_OPENDRAIN | PIN_PORTB | PIN11)

