apache/nuttx/arch/arm/src/kinetis/chip/kinetis_k28pinmux.h
#define PIN_I2C3_SCL_1                  (PIN_ALT2_OPENDRAIN | PIN_PORTA | PIN31)
#define PIN_I2C3_SCL_2                  (PIN_ALT2_OPENDRAIN | PIN_PORTC | PIN29)
#define PIN_I2C3_SCL_3                  (PIN_ALT2_OPENDRAIN | PIN_PORTE | PIN11)
#define PIN_I2C3_SCL_4                  (PIN_ALT4_OPENDRAIN | PIN_PORTA | PIN2)
#define PIN_I2C3_SDA_1                  (PIN_ALT2_OPENDRAIN | PIN_PORTA | PIN30)
#define PIN_I2C3_SDA_2                  (PIN_ALT2_OPENDRAIN | PIN_PORTC | PIN28)
#define PIN_I2C3_SDA_3                  (PIN_ALT2_OPENDRAIN | PIN_PORTE | PIN10)
#define PIN_I2C3_SDA_4                  (PIN_ALT4_OPENDRAIN | PIN_PORTA | PIN1)

/* I2S */

#define PIN_I2S0_MCLK_1                 (PIN_ALT4 | PIN_PORTC | PIN8)
#define PIN_I2S0_MCLK_2                 (PIN_ALT4 | PIN_PORTE | PIN6)
#define PIN_I2S0_MCLK_3                 (PIN_ALT6 | PIN_PORTA | PIN17)
#define PIN_I2S0_MCLK_4                 (PIN_ALT6 | PIN_PORTC | PIN6)
#define PIN_I2S0_RX_BCLK_1              (PIN_ALT4 | PIN_PORTC | PIN6)
#define PIN_I2S0_RX_BCLK_2              (PIN_ALT4 | PIN_PORTC | PIN9)
#define PIN_I2S0_RX_BCLK_3              (PIN_ALT4 | PIN_PORTE | PIN9)
#define PIN_I2S0_RX_BCLK_4              (PIN_ALT6 | PIN_PORTA | PIN14)
#define PIN_I2S0_RX_FS_1                (PIN_ALT4 | PIN_PORTC | PIN10)
#define PIN_I2S0_RX_FS_2                (PIN_ALT4 | PIN_PORTC | PIN7)
#define PIN_I2S0_RX_FS_3                (PIN_ALT4 | PIN_PORTE | PIN8)
#define PIN_I2S0_RX_FS_4                (PIN_ALT6 | PIN_PORTA | PIN16)
#define PIN_I2S0_RXD0_1                 (PIN_ALT4 | PIN_PORTC | PIN5)
#define PIN_I2S0_RXD0_2                 (PIN_ALT4 | PIN_PORTE | PIN7)
#define PIN_I2S0_RXD0_3                 (PIN_ALT6 | PIN_PORTA | PIN15)
#define PIN_I2S0_RXD1_1                 (PIN_ALT2 | PIN_PORTE | PIN8)
#define PIN_I2S0_RXD1_2                 (PIN_ALT4 | PIN_PORTC | PIN11)
#define PIN_I2S0_RXD1_3                 (PIN_ALT7 | PIN_PORTA | PIN16)
#define PIN_I2S0_TX_BCLK_1              (PIN_ALT4 | PIN_PORTB | PIN18)
#define PIN_I2S0_TX_BCLK_2              (PIN_ALT4 | PIN_PORTE | PIN12)
#define PIN_I2S0_TX_BCLK_3              (PIN_ALT6 | PIN_PORTA | PIN5)
#define PIN_I2S0_TX_BCLK_4              (PIN_ALT6 | PIN_PORTC | PIN3)
#define PIN_I2S0_TX_FS_1                (PIN_ALT4 | PIN_PORTB | PIN19)
#define PIN_I2S0_TX_FS_2                (PIN_ALT4 | PIN_PORTE | PIN11)
#define PIN_I2S0_TX_FS_3                (PIN_ALT6 | PIN_PORTA | PIN13)
#define PIN_I2S0_TX_FS_4                (PIN_ALT6 | PIN_PORTC | PIN2)
#define PIN_I2S0_TXD0_1                 (PIN_ALT4 | PIN_PORTE | PIN10)
#define PIN_I2S0_TXD0_2                 (PIN_ALT6 | PIN_PORTA | PIN12)
#define PIN_I2S0_TXD0_3                 (PIN_ALT6 | PIN_PORTC | PIN1)
#define PIN_I2S0_TXD1_1                 (PIN_ALT2 | PIN_PORTE | PIN9)
#define PIN_I2S0_TXD1_2                 (PIN_ALT6 | PIN_PORTC | PIN0)
#define PIN_I2S0_TXD1_3                 (PIN_ALT7 | PIN_PORTA | PIN14)

#define PIN_I2S1_MCLK_1                 (PIN_ALT4 | PIN_PORTE | PIN13)
#define PIN_I2S1_MCLK_2                 (PIN_ALT7 | PIN_PORTA | PIN17)
#define PIN_I2S1_RX_BCLK_1              (PIN_ALT5 | PIN_PORTE | PIN23)
#define PIN_I2S1_RX_BCLK_2              (PIN_ALT7 | PIN_PORTA | PIN31)
#define PIN_I2S1_RX_FS_1                (PIN_ALT5 | PIN_PORTE | PIN22)
#define PIN_I2S1_RX_FS_2                (PIN_ALT7 | PIN_PORTA | PIN30)
#define PIN_I2S1_RXD0_1                 (PIN_ALT5 | PIN_PORTE | PIN21)
#define PIN_I2S1_RXD0_2                 (PIN_ALT7 | PIN_PORTA | PIN29)
#define PIN_I2S1_RXD1_1                 (PIN_ALT5 | PIN_PORTE | PIN20)
#define PIN_I2S1_RXD1_2                 (PIN_ALT7 | PIN_PORTA | PIN28)
#define PIN_I2S1_TX_BCLK_1              (PIN_ALT5 | PIN_PORTE | PIN16)
#define PIN_I2S1_TX_BCLK_2              (PIN_ALT7 | PIN_PORTA | PIN24)
#define PIN_I2S1_TX_FS_1                (PIN_ALT5 | PIN_PORTE | PIN17)
#define PIN_I2S1_TX_FS_2                (PIN_ALT7 | PIN_PORTA | PIN25)
#define PIN_I2S1_TXD0_1                 (PIN_ALT5 | PIN_PORTE | PIN18)
#define PIN_I2S1_TXD0_2                 (PIN_ALT7 | PIN_PORTA | PIN26)
#define PIN_I2S1_TXD1_1                 (PIN_ALT5 | PIN_PORTE | PIN19)
#define PIN_I2S1_TXD1_2                 (PIN_ALT7 | PIN_PORTA | PIN27)

/* JTAG/SWD */

#define PIN_JTAG_TCLK                   (PIN_ALT7 | PIN_PORTA | PIN0)
#define PIN_JTAG_TDI                    (PIN_ALT7 | PIN_PORTA | PIN1)
#define PIN_JTAG_TDO                    (PIN_ALT7 | PIN_PORTA | PIN2)
#define PIN_JTAG_TMS                    (PIN_ALT7 | PIN_PORTA | PIN3)
#define PIN_JTAG_TRST_b                 (PIN_ALT7 | PIN_PORTA | PIN5)

#define PIN_SWD_CLK                     (PIN_ALT7 | PIN_PORTA | PIN0)
#define PIN_SWD_DIO                     (PIN_ALT7 | PIN_PORTA | PIN3)

/* Low-leakage wakeup module (LLWU, actually GPIO configurations) */

#define PIN_LLWU_P0                     (PIN_ALT1 | PIN_PORTE | PIN1)
#define PIN_LLWU_P1                     (PIN_ALT1 | PIN_PORTE | PIN2)
#define PIN_LLWU_P2                     (PIN_ALT1 | PIN_PORTE | PIN4)
#define PIN_LLWU_P3                     (PIN_ALT1 | PIN_PORTA | PIN4)
#define PIN_LLWU_P4                     (PIN_ALT1 | PIN_PORTA | PIN13)
#define PIN_LLWU_P5                     (PIN_ALT1 | PIN_PORTB | PIN0)
#define PIN_LLWU_P6                     (PIN_ALT1 | PIN_PORTC | PIN1)
#define PIN_LLWU_P7                     (PIN_ALT1 | PIN_PORTC | PIN3)
#define PIN_LLWU_P8                     (PIN_ALT1 | PIN_PORTC | PIN4)
#define PIN_LLWU_P9                     (PIN_ALT1 | PIN_PORTC | PIN5)
#define PIN_LLWU_P10                    (PIN_ALT1 | PIN_PORTC | PIN6)
#define PIN_LLWU_P11                    (PIN_ALT1 | PIN_PORTC | PIN11)
#define PIN_LLWU_P12                    (PIN_ALT1 | PIN_PORTD | PIN0)
#define PIN_LLWU_P13                    (PIN_ALT1 | PIN_PORTD | PIN2)
#define PIN_LLWU_P14                    (PIN_ALT1 | PIN_PORTD | PIN4)
#define PIN_LLWU_P15                    (PIN_ALT1 | PIN_PORTD | PIN6)
#define PIN_LLWU_P16                    (PIN_ALT1 | PIN_PORTE | PIN6)
#define PIN_LLWU_P17                    (PIN_ALT1 | PIN_PORTE | PIN9)
#define PIN_LLWU_P18                    (PIN_ALT1 | PIN_PORTE | PIN10)
#define PIN_LLWU_P19                    (PIN_ALT1 | PIN_PORTE | PIN17)
#define PIN_LLWU_P20                    (PIN_ALT1 | PIN_PORTE | PIN18)
#define PIN_LLWU_P21                    (PIN_ALT1 | PIN_PORTA | PIN21)
#define PIN_LLWU_P22                    (PIN_ALT1 | PIN_PORTA | PIN10)
#define PIN_LLWU_P23                    (PIN_ALT1 | PIN_PORTA | PIN11)
#define PIN_LLWU_P24                    (PIN_ALT1 | PIN_PORTD | PIN8)
#define PIN_LLWU_P25                    (PIN_ALT1 | PIN_PORTD | PIN11)

/* Low-Power Timers (LPTMR) */

#define PIN_LPTMR0_ALT1                 (PIN_ALT6 | PIN_PORTA | PIN19)
#define PIN_LPTMR0_ALT2                 (PIN_ALT3 | PIN_PORTC | PIN5)
#define PIN_LPTMR0_ALT3                 (PIN_ALT6 | PIN_PORTE | PIN17)

#define PIN_LPTMR1_ALT1                 (PIN_ALT6 | PIN_PORTA | PIN19)
#define PIN_LPTMR1_ALT2                 (PIN_ALT3 | PIN_PORTC | PIN5)

/* Low-Power UARTS (LPUART) */

#define PIN_LPUART0_CTS_1               (PIN_ALT2 | PIN_PORTA | PIN0)
#define PIN_LPUART0_CTS_2               (PIN_ALT2 | PIN_PORTB | PIN13)
#define PIN_LPUART0_CTS_3               (PIN_ALT3 | PIN_PORTA | PIN16)
#define PIN_LPUART0_CTS_4               (PIN_ALT3 | PIN_PORTB | PIN3)
#define PIN_LPUART0_CTS_5               (PIN_ALT3 | PIN_PORTC | PIN26)
#define PIN_LPUART0_CTS_6               (PIN_ALT3 | PIN_PORTD | PIN5)
#define PIN_LPUART0_RTS_1               (PIN_ALT2 | PIN_PORTA | PIN3)
#define PIN_LPUART0_RTS_2               (PIN_ALT2 | PIN_PORTB | PIN12)
#define PIN_LPUART0_RTS_3               (PIN_ALT3 | PIN_PORTA | PIN17)
#define PIN_LPUART0_RTS_4               (PIN_ALT3 | PIN_PORTB | PIN2)
#define PIN_LPUART0_RTS_5               (PIN_ALT3 | PIN_PORTC | PIN27)
#define PIN_LPUART0_RTS_6               (PIN_ALT3 | PIN_PORTD | PIN4)
#define PIN_LPUART0_RX_1                (PIN_ALT2 | PIN_PORTA | PIN1)
#define PIN_LPUART0_RX_2                (PIN_ALT2 | PIN_PORTB | PIN14)
#define PIN_LPUART0_RX_3                (PIN_ALT3 | PIN_PORTA | PIN15)
#define PIN_LPUART0_RX_4                (PIN_ALT3 | PIN_PORTB | PIN16)
#define PIN_LPUART0_RX_5                (PIN_ALT3 | PIN_PORTC | PIN25)
#define PIN_LPUART0_RX_6                (PIN_ALT3 | PIN_PORTD | PIN6)
#define PIN_LPUART0_TX_1                (PIN_ALT2 | PIN_PORTA | PIN2)
#define PIN_LPUART0_TX_2                (PIN_ALT2 | PIN_PORTB | PIN15)
#define PIN_LPUART0_TX_3                (PIN_ALT3 | PIN_PORTA | PIN14)
#define PIN_LPUART0_TX_4                (PIN_ALT3 | PIN_PORTB | PIN17)
#define PIN_LPUART0_TX_5                (PIN_ALT3 | PIN_PORTC | PIN24)
#define PIN_LPUART0_TX_6                (PIN_ALT3 | PIN_PORTD | PIN7)

