apache/nuttx/arch/arm/src/kinetis/chip/kinetis_k28pinmux.h
#define PIN_LPUART1_CTS_1               (PIN_ALT3 | PIN_PORTC | PIN2)
#define PIN_LPUART1_CTS_2               (PIN_ALT3 | PIN_PORTD | PIN11)
#define PIN_LPUART1_CTS_3               (PIN_ALT3 | PIN_PORTE | PIN2)
#define PIN_LPUART1_RTS_1               (PIN_ALT3 | PIN_PORTC | PIN1)
#define PIN_LPUART1_RTS_2               (PIN_ALT3 | PIN_PORTD | PIN10)
#define PIN_LPUART1_RTS_3               (PIN_ALT3 | PIN_PORTE | PIN3)
#define PIN_LPUART1_RX_1                (PIN_ALT3 | PIN_PORTC | PIN3)
#define PIN_LPUART1_RX_2                (PIN_ALT3 | PIN_PORTD | PIN8)
#define PIN_LPUART1_RX_3                (PIN_ALT3 | PIN_PORTE | PIN1)
#define PIN_LPUART1_TX_1                (PIN_ALT3 | PIN_PORTC | PIN4)
#define PIN_LPUART1_TX_2                (PIN_ALT3 | PIN_PORTD | PIN9)
#define PIN_LPUART1_TX_3                (PIN_ALT3 | PIN_PORTE | PIN0)

#define PIN_LPUART2_CTS_1               (PIN_ALT3 | PIN_PORTA | PIN26)
#define PIN_LPUART2_CTS_2               (PIN_ALT3 | PIN_PORTD | PIN1)
#define PIN_LPUART2_CTS_3               (PIN_ALT3 | PIN_PORTE | PIN18)
#define PIN_LPUART2_RTS_1               (PIN_ALT3 | PIN_PORTA | PIN27)
#define PIN_LPUART2_RTS_2               (PIN_ALT3 | PIN_PORTD | PIN0)
#define PIN_LPUART2_RTS_3               (PIN_ALT3 | PIN_PORTE | PIN19)
#define PIN_LPUART2_RX_1                (PIN_ALT3 | PIN_PORTA | PIN25)
#define PIN_LPUART2_RX_2                (PIN_ALT3 | PIN_PORTD | PIN2)
#define PIN_LPUART2_RX_3                (PIN_ALT3 | PIN_PORTE | PIN13)
#define PIN_LPUART2_RX_4                (PIN_ALT3 | PIN_PORTE | PIN17)
#define PIN_LPUART2_TX_1                (PIN_ALT3 | PIN_PORTA | PIN24)
#define PIN_LPUART2_TX_2                (PIN_ALT3 | PIN_PORTD | PIN3)
#define PIN_LPUART2_TX_3                (PIN_ALT3 | PIN_PORTE | PIN12)
#define PIN_LPUART2_TX_4                (PIN_ALT3 | PIN_PORTE | PIN16)

#define PIN_LPUART3_CTS_1               (PIN_ALT3 | PIN_PORTA | PIN30)
#define PIN_LPUART3_CTS_2               (PIN_ALT3 | PIN_PORTB | PIN9)
#define PIN_LPUART3_CTS_3               (PIN_ALT3 | PIN_PORTC | PIN19)
#define PIN_LPUART3_CTS_4               (PIN_ALT3 | PIN_PORTE | PIN6)
#define PIN_LPUART3_RTS_1               (PIN_ALT3 | PIN_PORTA | PIN31)
#define PIN_LPUART3_RTS_2               (PIN_ALT3 | PIN_PORTB | PIN8)
#define PIN_LPUART3_RTS_3               (PIN_ALT3 | PIN_PORTC | PIN18)
#define PIN_LPUART3_RTS_4               (PIN_ALT3 | PIN_PORTE | PIN7)
#define PIN_LPUART3_RX_1                (PIN_ALT3 | PIN_PORTA | PIN29)
#define PIN_LPUART3_RX_2                (PIN_ALT3 | PIN_PORTB | PIN10)
#define PIN_LPUART3_RX_3                (PIN_ALT3 | PIN_PORTC | PIN16)
#define PIN_LPUART3_RX_4                (PIN_ALT3 | PIN_PORTE | PIN5)
#define PIN_LPUART3_TX_1                (PIN_ALT3 | PIN_PORTA | PIN28)
#define PIN_LPUART3_TX_2                (PIN_ALT3 | PIN_PORTB | PIN11)
#define PIN_LPUART3_TX_3                (PIN_ALT3 | PIN_PORTC | PIN17)
#define PIN_LPUART3_TX_4                (PIN_ALT3 | PIN_PORTE | PIN4)

#define PIN_LPUART4_CTS_1               (PIN_ALT3 | PIN_PORTA | PIN22)
#define PIN_LPUART4_CTS_2               (PIN_ALT3 | PIN_PORTC | PIN13)
#define PIN_LPUART4_CTS_3               (PIN_ALT3 | PIN_PORTE | PIN22)
#define PIN_LPUART4_RTS_1               (PIN_ALT3 | PIN_PORTA | PIN23)
#define PIN_LPUART4_RTS_2               (PIN_ALT3 | PIN_PORTC | PIN12)
#define PIN_LPUART4_RTS_3               (PIN_ALT3 | PIN_PORTE | PIN23)
#define PIN_LPUART4_RX_1                (PIN_ALT3 | PIN_PORTA | PIN21)
#define PIN_LPUART4_RX_2                (PIN_ALT3 | PIN_PORTC | PIN14)
#define PIN_LPUART4_RX_3                (PIN_ALT3 | PIN_PORTE | PIN21)
#define PIN_LPUART4_TX_1                (PIN_ALT3 | PIN_PORTA | PIN20)
#define PIN_LPUART4_TX_2                (PIN_ALT3 | PIN_PORTC | PIN15)
#define PIN_LPUART4_TX_3                (PIN_ALT3 | PIN_PORTE | PIN20)

/* NMI */

#define PIN_NMI                         (PIN_ALT7 | PIN_PORTA | PIN4)

/* Programmable Delay Block (PDB) */

#define PIN_PDB0_EXTRG_1                (PIN_ALT3 | PIN_PORTC | PIN0)
#define PIN_PDB0_EXTRG_2                (PIN_ALT3 | PIN_PORTC | PIN6)

/* Quad-SPI (QSPI) */

#define PIN_QSPI0A_DATA0_1              (PIN_ALT5 | PIN_PORTE | PIN2)
#define PIN_QSPI0A_DATA0_2              (PIN_ALT7 | PIN_PORTC | PIN26)
#define PIN_QSPI0A_DATA1_1              (PIN_ALT5 | PIN_PORTE | PIN4)
#define PIN_QSPI0A_DATA1_2              (PIN_ALT7 | PIN_PORTC | PIN28)
#define PIN_QSPI0A_DATA2_1              (PIN_ALT5 | PIN_PORTE | PIN3)
#define PIN_QSPI0A_DATA2_2              (PIN_ALT7 | PIN_PORTC | PIN27)
#define PIN_QSPI0A_DATA3_1              (PIN_ALT5 | PIN_PORTE | PIN0)
#define PIN_QSPI0A_DATA3_2              (PIN_ALT7 | PIN_PORTC | PIN24)
#define PIN_QSPI0A_DQS                  (PIN_ALT7 | PIN_PORTE | PIN11)
#define PIN_QSPI0A_SCLK_1               (PIN_ALT5 | PIN_PORTE | PIN1)
#define PIN_QSPI0A_SCLK_2               (PIN_ALT7 | PIN_PORTC | PIN25)
#define PIN_QSPI0A_SS0_B_1              (PIN_ALT5 | PIN_PORTE | PIN5)
#define PIN_QSPI0A_SS0_B_2              (PIN_ALT7 | PIN_PORTC | PIN29)
#define PIN_QSPI0A_SS1_B_3              (PIN_ALT7 | PIN_PORTC | PIN19)
#define PIN_QSPI0A_SS1_B_4              (PIN_ALT7 | PIN_PORTE | PIN7)

#define PIN_QSPI0B_DATA0                (PIN_ALT5 | PIN_PORTE | PIN8)
#define PIN_QSPI0B_DATA1                (PIN_ALT5 | PIN_PORTE | PIN10)
#define PIN_QSPI0B_DATA2                (PIN_ALT5 | PIN_PORTE | PIN9)
#define PIN_QSPI0B_DATA3                (PIN_ALT5 | PIN_PORTE | PIN6)
#define PIN_QSPI0B_DQS                  (PIN_ALT5 | PIN_PORTE | PIN12)
#define PIN_QSPI0B_SCLK                 (PIN_ALT5 | PIN_PORTE | PIN7)
#define PIN_QSPI0B_SS0_B                (PIN_ALT5 | PIN_PORTE | PIN11)
#define PIN_QSPI0B_SS1_B                (PIN_ALT5 | PIN_PORTE | PIN13)

/* RTC clock outputs */

#define PIN_RTC_CLKOUT_1                (PIN_ALT6 | PIN_PORTA | PIN22)
#define PIN_RTC_CLKOUT_2                (PIN_ALT7 | PIN_PORTE | PIN0)

/* Secured digital host controller (SDHC) */

#define PIN_SDHC0_CLKIN                 (PIN_ALT6 | PIN_PORTE | PIN13)
#define PIN_SDHC0_CMD_1                 (PIN_ALT4 | PIN_PORTA | PIN27)
#define PIN_SDHC0_CMD_2                 (PIN_ALT4 | PIN_PORTE | PIN3)
#define PIN_SDHC0_D0_1                  (PIN_ALT4 | PIN_PORTA | PIN25)
#define PIN_SDHC0_D0_2                  (PIN_ALT4 | PIN_PORTE | PIN1)
#define PIN_SDHC0_D1_1                  (PIN_ALT4 | PIN_PORTA | PIN24)
#define PIN_SDHC0_D1_2                  (PIN_ALT4 | PIN_PORTE | PIN0)
#define PIN_SDHC0_D2_1                  (PIN_ALT4 | PIN_PORTA | PIN29)
#define PIN_SDHC0_D2_2                  (PIN_ALT4 | PIN_PORTE | PIN5)
#define PIN_SDHC0_D3_1                  (PIN_ALT4 | PIN_PORTA | PIN28)
#define PIN_SDHC0_D3_2                  (PIN_ALT4 | PIN_PORTE | PIN4)
#define PIN_SDHC0_D4                    (PIN_ALT7 | PIN_PORTE | PIN6)
#define PIN_SDHC0_D5                    (PIN_ALT7 | PIN_PORTE | PIN8)
#define PIN_SDHC0_D6                    (PIN_ALT7 | PIN_PORTE | PIN9)
#define PIN_SDHC0_D7                    (PIN_ALT7 | PIN_PORTE | PIN10)
#define PIN_SDHC0_DCLK_1                (PIN_ALT4 | PIN_PORTA | PIN26)
#define PIN_SDHC0_DCLK_2                (PIN_ALT4 | PIN_PORTE | PIN2)

